{
    "Total_Advisories": 45,
    "Unique_Advisories": 31,
    "Advisories": [
        {
            "cve": "CVE-2015-2156",
            "description": "Netty is vulnerable to Information Disclosure.  Multiple methods in multiple files improperly validate cookie names and values. This allows the presence of single-quote and double-quote characters to break tokenization.  A remote attacker can exploit this vulnerability by inducing a victim to send a crafted request containing quote characters in any parameter value that sets a cookie.  If that tainted cookie gets reflected in the response, the attacker can then use Cross-Site Scripting (XSS) to potentially retrieve the entire cookie header, despite the presence of an `HttpOnly` flag.\n\n*Advisory Deviation Notice*\nThe Sonatype security research team discovered that the vulnerability is present in all versions prior to 3.9.7.Final and 3.10.x before 3.10.2.Final, and not in all the versions before 3.9.8.Final and 3.10.x before 3.10.3.Final as the advisory states.\n"
        },
        {
            "cve": "CVE-2016-4970",
            "description": "Netty is vulnerable to Denial of Service (DoS). The `wrap()` function in the `OpenSslEngine` class doesn't properly handle renegotiations, causing the application to hang in an infinite loop. A remote attacker could exploit this vulnerability by sending multiple requests to the application to consume large amounts of CPU cycles, which can result in Denial of Service (DoS).\r\n\r\n*Advisory Deviation Notice*\r\nThe Sonatype security research team discovered that the vulnerability is present in version 4.0.20 until 4.0.37, not in all the versions from 4.0.0 till 4.0.37 as the advisory states."
        },
        {
            "cve": "CVE-2019-20444",
            "description": "The `netty-codec-http` package is vulnerable to HTTP Request Smuggling. The `splitHeader` method in `HttpObjectDecoder.class` does not ensure that headers have colons when processing HTTP requests. As this will lead to requests being interpreted inconsistently, an attacker can exploit this behavior to potentially smuggle HTTP Requests.\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the root cause of the vulnerability is also in 5.0.0.Alpha1 and 5.0.0.Alpha2, not just in versions before 4.1.44 as stated in the advisory.\n"
        },
        {
            "cve": "CVE-2019-20445",
            "description": "The `netty-codec-http` package is vulnerable to HTTP Request Smuggling. The `readHeaders` method in `HttpObjectDecoder.class` accepts HTTP requests that contain multiple `Content-Length` headers or that contain both a `Content-Length` and `Transfer-Encoding` header. A remote attacker can exploit this functionality to potentially hide additional HTTP requests that will be interpreted differently by different parsers.\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the vulnerability is in 5.0.0.Alpha1 and 5.0.0.Alpha2, not just in versions before 4.1.44, as stated in the advisory."
        },
        {
            "cve": "sonatype-2020-0029",
            "description": "The `netty-codec` and `netty` packages are vulnerable to Denial of Service (DoS) attacks. The `decode` methods in `JdkZlibDecoder.class`, `JZlibDecoder.class`, `JZlibDecoder.class` and `ZlibDecoder.class` do not limit the eventual size of a compressed buffer after it is decompressed. Consequently, a malicious request can consume much more memory on a server than the size of the request would imply. An attacker can exploit this behavior by sending many such requests, resulting in a DoS situation.\n\n*Note*: CVE-2020-11612 has been assigned to this issue. \n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the vulnerability is present in all versions before 4.1.46.Final and versions 5.0.0.Alpha1 through 5.0.0.Alpha2, not just versions 4.1.x before 4.1.46 as the advisory states."
        },
        {
            "cve": "sonatype-2021-1694",
            "description": "The `gson` package is vulnerable Deserialization of Untrusted Data. The serializable `LazilyParsedNumber`, `LinkedHashTreeMap`, and `LinkedTreeMap` classes permit unsafe deserialization due to use of the default `Serializable.readObject()` implementation. A remote attacker can exploit this vulnerability by serializing and supplying any of the aforementioned objects to an affected application. This will result in a Denial of Service (DoS) condition or other unexpected behavior when the malicious object is deserialized.\n\nNote: This vulnerability has been assigned CVE-2022-25647.\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the root cause of the vulnerability is in 2.2.3, not in all versions before 2.8.9 as the advisory states."
        },
        {
            "cve": "CVE-2020-26939",
            "description": "The Bouncy Castle Crypto package is vulnerable to Timing Attacks. The `decodeBlock` method in `OAEPEncoding.class`, `decodeBlockOrRandom` and `decodeBlock` methods in `PKCS1Encoding.class`, and `convertOutput` method in `RSACoreEngine.class` do not properly maintain constant time when decoding inputs of various lengths, specifically short inputs for the OAEP Decoder. An attacker can exploit this by observing the difference in time taken to decode inputs of various lengths in order to expose private encryption keys.\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the fix for this vulnerability was actually introduced in version 1.61 instead of 1.55 as stated in the advisory."
        },
        {
            "cve": "CVE-2020-36518",
            "description": "The `jackson-databind` package is vulnerable to a Denial of Service (DoS) attack. The `deserialize()` method in the `UntypedObjectDeserializer` and `UntypedObjectDeserializer$Vanilla` classes fails to restrict recursion when deserializing nested untyped or generic objects. A remote attacker who can supply data to be deserialized by an affected application can exploit this vulnerability to cause the JVM to consume all available memory, resulting in a `StackOverflow` exception and ultimately a DoS condition.\n\n*Advisory Deviation Notice*: The Sonatype security research team has discovered that this vulnerability was fixed in versions 2.13.2.1 and 2.12.6.1 and not 2.13.0 as stated in the advisory."
        },
        {
            "cve": "CVE-2019-0232",
            "description": "The CGI Servlet in Apache Tomcat is vulnerable to Remote Code Execution. The `init` and `setupFromRequest` methods in the `CGIServlet.class` do not properly decode any command-line arguments supplied as an input to the CGI Servlet. When running on Windows systems with the `enableCmdLineArguments` option enabled, the component could allow an attacker to execute code remotely by supplying crafted input in a request.\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that in the 8.x versions of the component, the vulnerability is present from 8.0.0 until 8.5.39 and not from the 8.5.0 version as stated in the advisory. Additionally, one of the mitigations specified in the advisory (\"Upgrade to Apache Tomcat 7.0.93 or later when released\") is incorrect since version 7.0.93 is vulnerable as well.  7.0.94 contains the fix for 7.0.x."
        },
        {
            "cve": "CVE-2019-17563",
            "description": "Apache Tomcat is vulnerable to Session Fixation. The `matchRequest` and `authenticate` methods in `FormAuthenticator.class` do not properly ensure that the Principal is not cached in the session when caching is set to false. This creates a small window of opportunity in which a remote attacker can execute a session fixation attack against a victim.\n\n*Advisory Deviation Notice:* The Sonatype security research team has discovered that the vulnerability is present in 8.0.X versions as well, not just versions 8.5.0 to 8.5.49 as the advisory states."
        },
        {
            "cve": "CVE-2020-9484",
            "description": "The `tomcat-catalina` package is vulnerable to Remote Code Execution (RCE). The `file()` method in the `FileStore` class fails to enforce the current FileStore directory when creating a file Object, allowing specific configurations of Tomcat instances to attempt to deserialize files outside of the file store. An attacker that knows the FileStore location in addition to having control over the file that is passed into the `FileStore` object as input may craft a request that can trigger arbitrary code execution on Tomcat servers. \n\nThis vulnerability can only be exploited under the following specific circumstances:\n* The Persistence Manager is using a default  `sessionAttributeValueClassNameFilter` value of null, or a value that is permissive enough to allow object inputs to be deserialized by the FileStore object\n\n* The `FileStore` is enabled for the `PersistenceManager`\n\n* The attacker knows the FileStore path\n\n* The attacker controls some other file path on the system. This includes the ability to create arbitrary files.'\n\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the vulnerability is also present in version the 4.x, 5.x, and 6.x branches of Apache Tomcat's Catalina component, not just the 7.x, 8.x, 9.x, and 10.x branches as the advisory states."
        },
        {
            "cve": "CVE-2018-8036",
            "description": "The `Apache PDFBox` is vulnerable to Uncontrolled Resource Consumption ('Resource Exhaustion'). A successful exploit could trigger an infinite loop scenario that may lead to an out-of-memory exception in the AFMParser component, resulting in a DoS condition. \n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the vulnerability got introduced from the version 1.0.0, not in the versions 1.8.0  as the advisory states.\nReference For affected version:\nhttps://issues.apache.org/jira/browse/PDFBOX-4251?page=com.atlassian.jira.plugin.system.issuetabpanels%3Aall-tabpanel"
        },
        {
            "cve": "CVE-2019-17571",
            "description": "The `log4j:log4j` package is vulnerable to Remote Code Execution (RCE) due to Deserialization of Untrusted Data. The `SocketNode` constructor in `SocketNode.class`, as referenced by the `SocketServer.class`, fails to properly verify if the objects being read from the `ObjectInputStream` belong to a list of classes which  are safe for deserialization. An attacker can exploit this vulnerability to deserialize objects of unsafe types, potentially resulting in Remote Code Execution (RCE).\n\nNOTE: Starting with version(s) 2.x, `log4j:log4j` was relocated to `org.apache.logging.log4j:log4j-core`. A variation of this vulnerability exists in `org.apache.logging.log4j:log4j-core` as CVE-2017-5645, in versions up to but excluding 2.8.2.\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the vulnerability actually impacts the `SocketNode` class being referenced by `SocketServer` class and not the `SocketServer` class itself as indicated in the NVD advisory. "
        },
        {
            "cve": "CVE-2021-4104",
            "description": "The `log4j:log4j` package is vulnerable to Deserialization of Untrusted Data. The `lookup()` and `activateOptions()` methods in the `JMSAppender` class allow `JNDI` lookup requests to be made when the `TopicBindingName` and `TopicConnectionFactoryBindingName` specify a trusted host. Lookups made to this host may be used by attackers to request a serialized malicious Java Object that can be deserialized and executed, leading to Remote Code Execution (RCE). \n\nNote that this vulnerability is different from [CVE-2021-44228](https://nvd.nist.gov/vuln/detail/CVE-2021-44228) and requires the attacker to be in control of the third party host that is specified in the configuration, or write access to the Log4j configuration file in order to specify a malicious lookup host directly. This vulnerability also only affects the 1.x.x component of `Log4j` released under the `log4j:log4j` group and artifact IDs.\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the root cause of the vulnerability is in all versions of log4j:log4j, not just in the 1.2.x branch as the advisory states. "
        },
        {
            "cve": "CVE-2018-18928",
            "description": "ICU is vulnerable to Integer Overflow or Wraparound. The `bcdToBigDecimal()` method in the `DecimalQuantity_DualStorageBCD.class` and the `toScientificString()` method in the `DecimalQuantity_AbstractBCD.class` do not properly check bounds of a user-supplied input before parsing it. A remote attacker can exploit this behavior by submitting a specially-crafted input which, when parsed, would result in Denial of Service (DoS) or arbitrary code execution.\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the root cause of the vulnerability also exists in the Java port of the component, and not just in the C/C++ component as the advisory states."
        },
        {
            "cve": "CVE-2018-11771",
            "description": "The Apache Commons Compress package is vulnerable to Denial of Service (DoS). The `readStored()` method in `ZipArchiveInputStream.class` silently returns a -1 on corrupted zip archives and continues to process them.  A remote attacker can exploit this by purposely uploading a corrupted archive that the vulnerable application will process indefinitely.   \n\n*Advisory Deviation Notice: The Sonatype security research team discovered that the root cause of the vulnerability is in 1.0, not in 1.7 as the advisory states."
        },
        {
            "cve": "CVE-2022-26520",
            "description": "The `postgresql` package is vulnerable to Improper Input Validation. The `setupLoggerFromProperties()` method in the `Driver` class sets `loggerLevel` and `loggerFile` properties of the Java logger from parameters extracted from JDBC URLs. A remote attacker who can provide a JDBC URL or its properties can exploit this vulnerability to write to files in arbitrary locations on the affected server.\n\nNote: The Sonatype security research team has determined that, while the project disputes this vulnerability, risk exists for applications that accept JDBC URLs or their properties from untrusted users. Ultimately, the project addressed this issue in version 42.3.3-rc1 by removing the functionality responsible for setting the aforementioned logger properties from JDBC URLs.\n\n*Advisory Deviation Notice*: The Sonatype security research team discovered that this vulnerability was introduced in version 42.0.0 and therefore does not affect all versions prior to 42.3.3 as stated in the advisory."
        },
        {
            "cve": "CVE-2020-1935",
            "description": "The `tomcat-coyote` package is vulnerable to HTTP Request Smuggling. The `parseHeader` and `skipLine` methods in `Http11InputBuffer.class`, `InternalNioInputBuffer.class`, `InternalAprInputBuffer.class`, and `InternalInputBuffer.class` do not properly parse HTTP request header values in regards to end-of-line (EOL) parsing. An attacker can exploit this when Tomcat is located behind a reverse proxy, using a malicious and invalid Transfer-Encoding header that would then be parsed as valid.\n\n*Advisory Deviation Notice:* The Sonatype security research team has discovered that the vulnerability is present in 8.0.x versions prior to 8.5.0, not just 8.5.x versions as the advisory states."
        },
        {
            "cve": "CVE-2021-33037",
            "description": "The `tomcat-coyote` package is vulnerable to HTTP Request Smuggling attacks. The vulnerable methods and classes fail to properly validate HTTP requests with `Transfer-Encoding` header values when the specified client protocol version is `HTTP/1.0`. This allows attackers to smuggle data inside of HTTP requests when the protocol version is manually set by the client and the running `Tomcat` instance is sitting behind a reverse-proxy. This could result in unexpected behavior for web services utilizing `tomcat-coyote` and could potentially lead to Sensitive Information Disclosure, Data Corruption, or a Denial of Service (Dos) condition.\n\n*Vulnerable File(s) and Function(s)*:\n\norg/apache/coyote/http11/Http11Processor.class\n* addInputFilter()\n* prepareRequest()\n\norg/apache/coyote/http11/AbstractHttp11Processor.class\n* addInputFilter()\n* prepareRequest()\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the vulnerability is present in all versions before 8.5.68, not just 8.5.0 until 8.5.68 as the advisory states."
        },
        {
            "cve": "CVE-2018-3831",
            "description": "`elasticsearch` is vulnerable to Information Disclosure. The `renderResponse()` method in the `RestClusterGetSettingsAction` class fails to filter certain settings from the `ClusterGetSettingsResponse` object, and consequently exposes potentially sensitive information via the `/_cluster/settings` API endpoint. A remote authenticated attacker can exploit this vulnerability by sending a request to the affected cluster endpoint. This will result in the exposure of any sensitive information contained therein.\n\n*Advisory Deviation Notice*: The Sonatype security research team has discovered that this vulnerability was introduced in version 0.18.0 and is not present in all versions before 5.6.12 as stated in the advisory."
        },
        {
            "cve": "CVE-2018-1338",
            "description": "The Apache Tika `tika-core` package is vulnerable to Denial of Service (DoS) attacks. The `readUE7()` function in the `EndianUtils` class, used by the `BPGParser` class,  fails to validate the length of the incoming stream when parsing input. A remote attacker can trigger this vulnerability by crafting a malicious file that exploits this issue. The attacker can then entice a victim into submitting the file for processing. This will result in a DoS when the application attempts to process the file.\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that this vulnerability was introduced in version 1.7-rc1 and is not present in all versions prior to 1.18 as stated in the advisory."
        },
        {
            "cve": "CVE-2021-31812",
            "description": "The Apache `pdfbox` package is vulnerable to a Denial of Service (DoS) attack. The `parseXref()` method in the `COSParser` class, while parsing cross reference tables (Xref), fails to account for skipped whitespace characters when determining the current loop position. A remote attacker can leverage this vulnerability to cause an infinite loop by supplying a PDF file that contains Xref data that exploit this issue.\n\n*Advisory Deviation Notice*: The Sonatype security research team discovered that this vulnerability was introduced in version 1.7.0 and not 2.0.x as stated in the advisory."
        },
        {
            "cve": "CVE-2021-40690",
            "description": "The `xmlsec` package is vulnerable to Exposure of Sensitive Information to an Unauthorized Actor. The `resolveReferentKeyInfo()` and `validateReference()` methods in the `KeyInfoReferenceResolver` class do not properly pass the `secureValidation` property when creating a `KeyInfo` from a `KeyInfoReference` element. A remote attacker can exploit this behavior to extract any local `.xml` files during an XPath transform using the `RetrievalMethod` element. This would result in the attacker gaining access to otherwise restricted information on an application using this package to implement XML security standards.\n\n                *Advisory Deviation Notice:* Due to the attacker only being able to access XML files by exploiting this vulnerability, the Sonatype Security Research team lowered the Confidentiality impact to 'Low'."
        },
        {
            "cve": "CVE-2020-9489",
            "description": "The `tika-parsers` package is vulnerable to Denial of Service. The `ICNSParser.class`, `ID3v2Frame.class`, `MP4Parser.class`, `PDFParserConfig.class` and `OneNoteParser.class` classes improperly handle the input they receive and cause null pointer exceptions, memory writing out of the boundaries of the buffer or infinite loops. An attacker could take advantage of this behavior and craft a special payload for a vulnerable parser to crash the application.\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the vulnerability is present in version 0.7 until 1.24, not just in 1.24 as the advisory states.\n\n*Vulnerable File(s) and Function(s)*:\n\norg/apache/tika/parser/image/ICNSParser.class\n* parse()\n\norg/apache/tika/parser/mp3/ID3v2Frame.class\n* readFully()\n\norg/apache/tika/parser/mp4/MP4Parser.class\n* parse()\n\nMETA-INF/services/org.apache.tika.parser.Parser\n\norg/apache/tika/parser/pdf/PDFParserConfig.class\n* Serializable()"
        },
        {
            "cve": "CVE-2019-12415",
            "description": "The `org.apache.poi:poi-ooxml` package is vulnerable to XML eXternal Entity (XXE) Reference attacks. The `isValid` method in `XSSFExportToXml.class` does not properly validate `SchemaFactory` objects when parsing Excel documents. An attacker can use a crafted document to read arbitrary files on the vulnerable filesystem via XXE processing.\n\n*Advisory Deviation Notice:* The Sonatype security research team has discovered that the vulnerability was introduced in version `3.5-FINAL` of the package and not in the initial version, as the advisory states.\n"
        },
        {
            "cve": "CVE-2021-37714",
            "description": "The `jsoup` is vulnerable due to Uncaught Exception. The `appendTagName` function in the `Token.class` incorrectly processes user input that contains unexpected characters in variable amounts. An attacker could leverage this behavior to crash the application by sending malformed input to the application, which may include multiple null characters.\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the vulnerability is present from version 1.6.0 before 1.14.2, not all prior versions to 1.14.2 as the advisory states."
        },
        {
            "cve": "CVE-2018-10237",
            "description": "Guava is vulnerable to Denial of Service (DoS). When untrusted input is supplied to the `AtomicDoubleArray` and `CompoundOrdering` classes, it is possible for an attacker to specify a large integer number as part of that untrusted input.  This untrusted integer `n` is used to allocate an array of length `n`.  Thus with large values of `n`, it is possible to cause an application to run out of memory.\n\nAdvisory Deviation Notice: The Sonatype security research team discovered that the fix for this vulnerability was actually introduced in version 23.6.1 for 23.6.x instead of 24.1.1 as stated in https://nvd.nist.gov/vuln/detail/CVE-2018-10237"
        },
        {
            "cve": "CVE-2016-1000344",
            "description": "BouncyCastle uses an insecure encryption method when encrypting data using the Diffie-Hellman key exchange algorithm.  The `engineInit` method in the `IESCipher` class and `configure` method in the `DH` class implement the ECB mode for encryption, which may result in information about the clear text being leaked into the encrypted cipher text.  An attacker with access to the encrypted data can exploit this vulnerability by analyzing the encrypted data for patterns that reveal information about the clear text.  \n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the vulnerability is present in version 1.48 until 1.55, not 1.55 and earlier as the advisory states."
        },
        {
            "cve": "CVE-2016-1000352",
            "description": "BouncyCastle uses an insecure encryption method when encrypting data using the elliptic curve key exchange algorithm.  The `engineInit` method in the `IESCipher` class and `configure` method in the `EC` class implement the ECB mode for encryption, which may result in information about the clear text being leaked into the encrypted cipher text.  An attacker with access to the encrypted data can exploit this vulnerability by analyzing the encrypted data for patterns that reveal information about the clear text.  \n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the vulnerability is present in version 1.48 until 1.55, not 1.55 and earlier as the advisory states."
        },
        {
            "cve": "CVE-2020-7961",
            "description": "The `portal-impl` package is vulnerable to Deserialization of Untrusted Data. The `_createDefaultParameterValue` and `_prepareParameters` methods in `JSONWebServiceActionImpl.class` allows users to instantiate arbitrary classes. A remote attacker can leverage this behavior to execute code in a malicious manner.\n\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the fix for this vulnerability was only introduced in version 7.2.1 instead of 7.2.1, 7.1.3, 7.0.6 and 6.2.5 as stated in the advisory."
        },
        {
            "cve": "CVE-2021-44228",
            "description": "The `log4j-core` package is vulnerable to Deserialization of Untrusted data. The vulnerable methods allow the `JNDI` Java interface to be used to request resources from arbitrary URIs using the `LDAP` and `LDAPS` protocols. This leads to Java objects contained within the resource to be deserialized and processed. Applications that use the `log4j-core` library to log events and utilize application data in log messages may inadvertently allow user input to be included inside their log messages. Remote attackers can leverage this behavior to fetch a malicious resource under their control. This would lead to malicious Java code being deserialized and executed in the context of the vulnerable application and may lead to Remote Code Execution (RCE).\n\n*Advisory Deviation Notice:* The Sonatype security research team discovered that the root cause of the vulnerability is in `org.apache.logging.log4j:log4j-core`, and is not in `org.apache.logging.log4j:log4j-api` as the GitHub advisory states. The research team has also discovered that the vulnerable code was introduced in version 2.0-beta9 and not all versions before 2.15.0 are vulnerable as the GitHub advisory states. The 1.x branch is not affected by this vulnerability.\n\n*Vulnerable File(s) and Function(s)*:\n\norg/apache/logging/log4j/core/net/JndiManager.class\n* lookup()\n\norg/apache/logging/log4j/core/appender/mom/JmsAppender$Builder.class\n* build()"
        }
    ]
}